Documents/ПредварительноеСоглашение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПредварительноеСоглашение</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПосещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПоездки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПоездки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУчастников</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГородаПосещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГородаМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Договор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Договор</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПродажиТуров</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКлиентами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПредварительноеСоглашение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПосещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПоездки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПоездки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУчастников</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УчастникиПоездки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МаршрутПоездки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГородаМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Гостиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Отели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНомера</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНомеровГостиниц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПредварительноеСоглашение/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	// Запрет удаления, если есть договоры
	Если ПометкаУдаления ИЛИ РежимЗаписи = "Удаление" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Договор.Ссылка) КАК КоличествоДоговоров
		|ИЗ Документ.Договор КАК Договор
		|ГДЕ Договор.Соглашение = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Результат = Запрос.Выполнить().Выбрать();
		Результат.Следующий();
		
		Если Результат.КоличествоДоговоров > 0 Тогда
			Отказ = Истина;
			Сообщить("Нельзя удалить или пометить на удаление соглашение, на основании которого создан договор!");
			Возврат;
		КонецЕсли;
		
	КонецЕсли;

	// Проверка обязательных полей
	Если Организация = Неопределено Тогда
		Сообщить("Заполните организацию!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если Клиент = Неопределено Тогда
		Сообщить("Заполните клиента!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если СтранаПосещения = Неопределено Тогда
		Сообщить("Заполните страну посещения!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если НачалоПоездки = '00010101' Тогда
		Сообщить("Заполните начало поездки!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если ОкончаниеПоездки = '00010101' Тогда
		Сообщить("Заполните окончание поездки!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если КоличествоУчастников <= 0 Тогда
		Сообщить("Укажите количество участников!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если ГородаПосещения.Количество() = 0 Тогда
		Сообщить("Добавьте хотя бы один город!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

КонецПроцедуры            

Функция Печать(МассивОбъектов = Неопределено) Экспорт

	Если МассивОбъектов = Неопределено Тогда
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Ссылка);
	КонецЕсли;
	
	Возврат ПечатьСоглашения(МассивОбъектов);
	
КонецФункции

Функция ПечатьСоглашения(МассивОбъектов)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПечатнаяФорма";
	
	Макет = ПолучитьМакет("ПечатнаяФорма");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьДанные = Макет.ПолучитьОбласть("Данные");
	ОбластьШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТЧ");
	ОбластьДанныеТЧ = Макет.ПолучитьОбласть("ДанныеТЧ");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Для каждого ТекДокумент Из МассивОбъектов Цикл
		
		ДокОбъект = ТекДокумент.ПолучитьОбъект();
		
		// Шапка
		ОбластьШапка.Параметры.НомерСоглашения = ДокОбъект.Номер;
		ОбластьШапка.Параметры.ДатаСоглашения = Формат(ДокОбъект.Дата, "ДЛФ=Д");
		ТабДок.Вывести(ОбластьШапка);
		
		// Данные
		ОбластьДанные.Параметры.Организация = ДокОбъект.Организация;
		ОбластьДанные.Параметры.Агент = ДокОбъект.Агент;
		ОбластьДанные.Параметры.Клиент = ДокОбъект.Клиент;
		ОбластьДанные.Параметры.Страна = ДокОбъект.СтранаПосещения;
		ОбластьДанные.Параметры.ДатыПоездки = Формат(ДокОбъект.НачалоПоездки, "ДЛФ=Д") + " - " + Формат(ДокОбъект.ОкончаниеПоездки, "ДЛФ=Д");
		ОбластьДанные.Параметры.КоличествоУчастников = ДокОбъект.КоличествоУчастников;
		ТабДок.Вывести(ОбластьДанные);
		
		// Шапка таблицы городов
		ТабДок.Вывести(ОбластьШапкаТЧ);
		
		// Строки городов
		НомерСтроки = 1;
		Для каждого СтрокаГорода Из ДокОбъект.ГородаПосещения Цикл
			ОбластьДанныеТЧ.Параметры.НомерСтроки = НомерСтроки;
			ОбластьДанныеТЧ.Параметры.Город = СтрокаГорода.Город;
			ТабДок.Вывести(ОбластьДанныеТЧ);
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
		
		// Подвал
		ОбластьПодвал.Параметры.Агент = ДокОбъект.Агент;
		ОбластьПодвал.Параметры.Клиент = ДокОбъект.Клиент;
		ТабДок.Вывести(ОбластьПодвал);
		
		// Разделитель между документами
		Если МассивОбъектов.Найти(ТекДокумент) < МассивОбъектов.Количество() - 1 Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции
